/////Інструкція до бібліотеки * ver 2.1 //////////////////////////////////////
//Для звернення до піна в NANIT використовуємо  таку конструкцію
//"P4_1"  де P4 - це порт, а _1 це номер піна в цьому порту
//"P10_2" - аналоговий лише в 3 версії Nanit
//також "button" це сенсорна кнопка, на передній панелв наніта (Увага! Використовувати лише як INPUT).
//
//При введені назви порта та піна, він буде мати:
//	чорний колір - це означає що цим піном користуватися не можна;
//	помаранчевий - це звичайний цифровий пін;
//	помаранчевий жирний - це цифровий пін який може генерувати ШИМ сигнал
//	голубий - це звичайні аналогові піни, їх можна також використовувати як цифрові
//
//Увага! піни P1_4 та P1_3 а також P12_4 та P12_3 - це виходи з вдубованого драйвера і призначені для
//двигунів (напруга 3.7В)
//Увага! Живлення на портак 1, 2, 11, 12 - Має 3.7 (напруга АКБ).
//
//Функції: 
//Сенсорна кнопка MODE --- BUTTON(); - повертає true якщо сенсор інтерпретує натискання, інакше false
//Модуль RGB  --- RGB(0,125,255); - вказати колір 
//Список функцій та пінів на Nanit можна переглянути в таблиці, в папці бібліотеки NanitLib
////////////////////////////////////////////////////////////////////

#include <NanitLib.h> ///Підключаємо бібліотеку

void setup() {
 NanitStart(); //Ініціалізуємо бібліотеку	
	
pinMode(P4_3,OUTPUT); //Вказуємо, що на порту 4 контакт під №1 буде як вихід.
}

void loop() {
digitalWrite(P4_3,HIGH); //Подаємо високий рівень сигналу на 1 ніжку, 4 порту.
delay(500);
digitalWrite(P4_3,LOW); //Подаємо ybpmrbq рівень сигналу на 1 ніжку, 4 порту.
delay(500);
}